app/views/orders/show.html.erb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 1]]
SELECT COUNT(*) FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 2]]
---
    <th>Items:</th>
    <td><%= @order.order_items.count %></td>

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 4]]
---

  <% @order.order_items.each do |item| %>

SELECT "addresses".* FROM "addresses" WHERE "addresses"."user_id" = $1  [["user_id", 1]]
---
      <td>
      <%= f.select :address_id, current_user.addresses.collect{|a| [a.to_s, a.id]} %>