app/controllers/addresses_controller.rb

  def create
    @address = Address.new(address_params)

    respond_to do |format|
      if @address.save
---
INSERT INTO "addresses" ("line1", "line2", "city", "state", "zip", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def destroy
    @address.destroy
---
DELETE FROM "addresses" WHERE "addresses"."id" = $1  [["id", 9]]