app/controllers/application_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 AND "orders"."status" = $2 AND "orders"."user_id" = $3 LIMIT $4  [["id", 4], ["status", "unsubmitted"], ["user_id", 1], ["LIMIT", 1]]
---
  def load_order
    @order = Order.find_or_initialize_by(id: session[:order_id], status: 'unsubmmited', user_id: session[:user_id])