app/controllers/order_items_controller.rb

  def create
    # @order_item = OrderItem.new(order_item_params)
    # @order_item = OrderItem.new(product_id: params[:product_id], order_id: @order.id)
    # @order_item = @order.order_items.new(quantity: 1, product_id: params[:product_id])
    @order_item = @order.order_items.find_or_initialize_by(product_id: params[:product_id])
    @order_item.quantity += 1

    respond_to do |format|
      if @order_item.save
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1 AND "order_items"."product_id" = $2 LIMIT $3  [["order_id", 3], ["product_id", 4], ["LIMIT", 1]]
UPDATE "order_items" SET "quantity" = $1, "updated_at" = $2 WHERE "order_items"."id" = $3  [["quantity", 2], ["updated_at", "2021-11-29 20:10:31.156776"], ["id", 33]]

  def update
    @order_item = OrderItem.find(params[:id])
    respond_to do |format|
      if order_item_params[:quantity].to_i.zero?
        @order_item.destroy
        format.html { redirect_to @order_item.order, notice: 'Order item is removed from cart.' }
        format.json { head :no_content }
      elsif @order_item.update(order_item_params)
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."id" = $1 LIMIT $2  [["id", 34], ["LIMIT", 1]]
DELETE FROM "order_items" WHERE "order_items"."id" = $1  [["id", 9]]
SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "order_items" SET "quantity" = $1, "updated_at" = $2 WHERE "order_items"."id" = $3  [["quantity", 9], ["updated_at", "2021-11-29 20:11:39.565987"], ["id", 34]]

  def destroy
    @order_item.destroy
---
DELETE FROM "order_items" WHERE "order_items"."id" = $1  [["id", 9]]

  def set_order_item
    @order_item = OrderItem.find(params[:id])
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."id" = $1 LIMIT $2  [["id", 34], ["LIMIT", 1]]

  def load_order
    @order = Order.find_or_initialize_by(id: session[:order_id],
                                         status: 'unsubmitted',
                                         user_id: session[:user_id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" IS NULL AND "orders"."status" = $1 AND "orders"."user_id" = $2 LIMIT $3  [["status", "unsubmitted"], ["user_id", 1], ["LIMIT", 1]]