app/controllers/orders_controller.rb

INSERT INTO "orders" ("user_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["status", ""], ["created_at", "2021-11-28 21:15:38.046370"], ["updated_at", "2021-11-28 21:15:38.046370"]]
---
  def create
    @order = Order.new(order_params)

    respond_to do |format|
      if @order.save