app/controllers/order_items_controller.rb

INSERT INTO "orders" ("id", "user_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["id", 7], ["user_id", 1], ["status", "unsubmmited"], ["created_at", "2021-11-29 20:11:31.255333"], ["updated_at", "2021-11-29 20:11:31.255333"]]
INSERT INTO "order_items" ("product_id", "order_id", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["product_id", 4], ["order_id", 1], ["quantity", 1], ["created_at", "2021-11-26 10:22:43.557417"], ["updated_at", "2021-11-26 10:22:43.557417"]]
---
  def create
    @order_item = @order.order_items.new(quantity: 1, product_id: params[:product_id])

    respond_to do |format|
      if @order_item.save