app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("title", "price", "description", "image_url", "created_at", "updated_at", "stock") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "updated_at" = $1, "stock" = $2 WHERE "products"."id" = $3  [["updated_at", "2021-11-26 05:52:33.791667"], ["stock", 5], ["id", 1]]