app/controllers/sessions_controller.rb

INSERT INTO "users" ("provider", "uid", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["provider", "twitter"], ["uid", "1464633061707030528"], ["created_at", "2021-11-27 19:45:30.634704"], ["updated_at", "2021-11-27 19:45:30.634704"]]
UPDATE "orders" SET "user_id" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["user_id", 1], ["updated_at", "2021-11-29 19:14:15.201101"], ["id", 7]]
---
  def create
    @user = User.find_or_create_by_auth(request.env['omniauth.auth'])
    load_order
    session[:user_id] = @user.id
    @order.update(user: @user)