app/models/user.rb

INSERT INTO "users" ("provider", "uid", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["provider", "twitter"], ["uid", "1464633061707030528"], ["created_at", "2021-11-27 19:45:30.634704"], ["updated_at", "2021-11-27 19:45:30.634704"]]
---
  def self.find_or_create_by_auth(auth_data)